05 RESPONSE-AREA.
    	10 BUC_AMT_0       PIC  9(8)V99.
    	10 BUC_AMT_1       PIC  9(8)V99.
    	10 BUC_AMT_2       PIC  9(8)V99.
	10 BUC_AMT_3       PIC  9(8)V99.
	10 BUC_AMT_4       PIC  9(8)V99.
	10 BUC_AMT_5       PIC  9(8)V99.	
	10 OUT_BAL	   PIC  9(8)V99.
	10 RCPT_DATE	   PIC  X(030).
	10 COLLECTOR_ID    PIC  X(100).
	10 COLLECTOR_NAME  PIC  X(030).
	10 RESPONSE_CODE   PIC  X(003).
	10 RESPONSE_MESSAGE PIC  X(150).